tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Shell plugin manager
brew "antibody"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool for DigitalOcean
brew "doctl"
# CLI tool for quick access to files and directories
brew "fasd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# UNIX shell (command interpreter)
brew "zsh"
# The Dart SDK
brew "dart-lang/dart/dart"
# GPU-accelerated terminal emulator
cask "alacritty"
cask "android-sdk"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Typeface made for developers
cask "font-jetbrains-mono"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# End-to-end encryption software
cask "keybase"
# App to write, plan, collaborate, and get organized
cask "notion"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Window management application (replacement for Divvy/SizeUp/ShiftIt)
cask "slate"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
