tap "ariga/tap"
tap "aws/tap"
tap "bufbuild/buf"
tap "buildkite/buildkite"
tap "dart-lang/dart"
tap "fluxcd/tap"
tap "gobuffalo/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "joerdav/xc"
tap "michaeleisel/zld"
tap "nikitabobko/tap"
tap "planetscale/tap"
brew "act"
brew "adr-tools"
brew "openssl@3"
brew "ansible"
brew "ansible-lint"
brew "antibody"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "awscli"
brew "boost"
brew "bottom"
brew "glib"
brew "checkov"
brew "consul"
brew "cowsay"
brew "openldap"
brew "curl"
brew "deno"
brew "direnv"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "doctl"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fasd"
brew "fish"
brew "flyctl"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-tar"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "go-bindata"
brew "go-task"
brew "gradle"
brew "grep"
brew "helm"
brew "htop"
brew "hugo"
brew "infracost"
brew "jq"
brew "python@3.10"
brew "k3sup"
brew "kind"
brew "kubernetes-cli"
brew "kubeseal"
brew "kubie"
brew "kustomize"
brew "libfido2"
brew "libpq"
brew "python@3.9"
brew "llvm"
brew "lsd"
brew "make"
brew "mas"
brew "minikube"
brew "protobuf"
brew "mosh"
brew "mysql-client"
brew "nmap"
brew "node"
brew "nomad"
brew "nvm"
brew "oci-cli"
brew "tmux"
brew "overmind"
brew "pdsh"
brew "php"
brew "pipx"
brew "postgresql@13"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv"
brew "python-tabulate"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rubyfmt"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "tailscale"
brew "teleport"
brew "temporal"
brew "terraform"
brew "terraform-docs"
brew "terrascan"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tldr"
brew "tmuxinator"
brew "tree"
brew "vault"
brew "vegeta"
brew "vips"
brew "watch"
brew "watchman"
brew "wget"
brew "wtfutil"
brew "yadm"
brew "yarn"
brew "yq"
brew "zsh"
brew "ariga/tap/atlas"
brew "aws/tap/copilot-cli"
brew "bufbuild/buf/buf"
brew "dart-lang/dart/dart"
brew "fluxcd/tap/flux"
brew "gobuffalo/tap/buffalo"
brew "hashicorp/tap/packer"
brew "jesseduffield/lazygit/lazygit"
brew "joerdav/xc/xc"
brew "michaeleisel/zld/zld"
brew "planetscale/tap/pscale"
cask "aerospace"
cask "alacritty"
cask "android-sdk"
cask "dbeaver-community"
cask "docker"
cask "finch"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logseq"
cask "multipass"
cask "ngrok"
cask "notion"
cask "rectangle"
cask "reflex"
cask "signal"
cask "slack"
cask "slate"
cask "vagrant"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "Hidden Folks+", id: 1584550483
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skate City", id: 1470376606
mas "Sonic Racing", id: 1461172325
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "The Last Campfire", id: 973039644
mas "Todoist", id: 585829637
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "4ops.packer"
vscode "a-h.templ"
vscode "alfredbirk.tailwind-documentation"
vscode "aliariff.vscode-erb-beautify"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "aswinkumar863.smarty-template-support"
vscode "austenc.tailwind-docs"
vscode "ban.spellright"
vscode "bbenoist.nix"
vscode "bradlc.vscode-tailwindcss"
vscode "brettm12345.nixfmt-vscode"
vscode "bufbuild.vscode-buf"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "casualjim.gotemplate"
vscode "charliermarsh.ruff"
vscode "cloudzero.costformation-toolkit"
vscode "codeium.codeium"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "denoland.vscode-deno"
vscode "dkundel.vscode-new-file"
vscode "dnlytras.nord-wave"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "eugene-musika.tomorrow-night-theme"
vscode "felixangelov.bloc"
vscode "fredwangwang.vscode-hcl-format"
vscode "fwcd.kotlin"
vscode "gilescope.arrowdebugging"
vscode "gilescope.rust-in-peace"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "ipedrazas.kubernetes-snippets"
vscode "kaiwood.endwise"
vscode "kalimahapps.tailwind-config-viewer"
vscode "kalimahapps.tailwindcss-kit"
vscode "maelvalais.autoconf"
vscode "marlosirapuan.nord-deep"
vscode "mathiasfrohlich.kotlin"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "misogi.ruby-rubocop"
vscode "monosans.djlint"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ninoseki.vscode-gem-lens"
vscode "omkarbhede.tailwindcss-tune"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "serayuzgur.crates"
vscode "shanehofstetter.rails-i18n"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sidp.strict-whitespace"
vscode "solarliner.linux-themes"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.sourcegraph"
vscode "sourcepirate.hclfmt"
vscode "stivo.tailwind-fold"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
